<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>zwz's</title>
  <link href="http://zjut.in:65011index.xml" rel="self" />
  <link href="http://zjut.in:65011"/>
  <updated>Lisp error in nil: (wrong-type-argument integerp nil)</updated>
  <id>http://zjut.in:65011index.xml</id>
  <entry><title type="html">解决换行符在 org-mode 导出 html 时的问题</title><author><name>nil</name></author><link href="http://zjut.in:65011/posts/2013/08/30_89e351b36362884c7b265728-org-mode-5bfc51fa-html-65f6768495ee9898.html"/><updated>2013-08-30T21:11:00Z</updated><published>2013-08-30T21:11:00Z</published><id>posts/2013/08/30_89e351b36362884c7b265728-org-mode-5bfc51fa-html-65f6768495ee9898.html</id><category scheme="/tags/orgmode.html" term="orgmode" label="orgmode"/><category scheme="/tags/html.html" term="html" label="html"/><content type="html">&lt;p&gt;
&#22312; emacs &#20013;&#36827;&#34892;&#25991;&#26412;&#32534;&#36753;&#26102;&#65292;&#32463;&#24120;&#20026;&#20102;&#32654;&#35266;&#21644;&#26041;&#20415;&#32534;&#36753;&#65292;&#36890;&#36807; M-q &#23545;&#27573;&#33853;&#20869;&#23481;&#36827;&#34892;&#37325;&#25490;&#12290;&#36825;&#26102;&#65292; emacs &#20250;&#33258;&#21160;&#26681;&#25454;
fill-column &#30340;&#22823;&#23567;&#65292;&#22312;&#21512;&#36866;&#30340;&#20301;&#32622;&#25554;&#20837;&#25442;&#34892;&#31526;&#65292;&#20351;&#24471;&#25991;&#23383;&#19981;&#20250;&#36807;&#38271;&#12290;&#36825;&#31181;&#25442;&#34892;&#31216;&#20043;&#20026;&#36719;&#25442;&#34892;&#12290;&#36890;&#24120;&#65292;&#36719;&#25442;&#34892;&#19981;&#20250;&#24102;&#26469;&#20160;&#20040;&#38382;&#39064;&#12290;&#20294;&#26159;&#22312;&#19968;&#20010;&#36719;&#20214;&#21644;&#21478;&#19968;&#20010;&#36719;&#20214;&#36827;&#34892;&#25968;&#25454;&#20132;&#25442;&#65292;&#25110;&#32773;&#19968;&#31181;&#26684;&#24335;&#36716;&#25442;&#20026;&#21478;&#19968;&#31181;&#26684;&#24335;&#30340;&#26102;&#20505;&#65292;&#36825;&#20010;&#38382;&#39064;&#23601;&#24320;&#22987;&#31361;&#26174;&#20986;&#26469;&#20102;&#12290;
&lt;/p&gt;

&lt;p&gt;
org-mode &#20316;&#20026;&#19968;&#20010;&#33021;&#22815;&#23548;&#20986;&#25104;&#20854;&#20182;&#22810;&#31181;&#26684;&#24335;&#30340;&#24378;&#22823;&#24037;&#20855;&#65292;&#23545;&#36719;&#25442;&#34892;&#36827;&#34892;&#20102;&#26684;&#22806;&#30340;&#29031;&#39038;&#65292;&#24341;&#20837;&#20102;&#22914;&#19979;&#19968;&#20010;&#36873;&#39033;&#65292;&#29992;&#20110;&#25511;&#21046;&#22312;&#23548;&#20986;&#26102;&#26159;&#21542;&#22312;&#36719;&#25442;&#34892;&#22788;&#20135;&#29983;&#19968;&#20010;&#25442;&#34892;&#12290;
&lt;/p&gt;
&lt;div class="org-src-container"&gt;

&lt;pre class="src src-org"&gt;&lt;span style="color: #00cdcd; font-style: italic;"&gt;#+OPTIONS: \n:nil&lt;/span&gt;
&lt;/pre&gt;
&lt;/div&gt;

&lt;p&gt;
&#26174;&#28982;&#65292;&#40664;&#35748;&#30340;&#22823;&#37096;&#20998;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#19981;&#24076;&#26395;&#20135;&#29983;&#19968;&#20010;&#30828;&#25442;&#34892;&#65292;&#27491;&#22914;&#19978;&#38754;&#30340;&#35774;&#32622;&#19968;&#26679;&#12290;&#27604;&#22914;&#65292;&#22914;&#26524;&#23558;&#19979;&#38754;&#30340;&#25991;&#26723;&#23548;&#20986;&#20026; html &#65292;&#27599;&#20010;&#36719;&#25442;&#34892;&#37117;&#20135;&#29983;&#19968;&#20010;&#30828;&#25442;&#34892;&#30340;&#35805;&#65292;&#32467;&#26524;&#30475;&#36215;&#26469;&#23558;&#20250;&#38750;&#24120;&#19981;&#32654;&#35266;&#65292;&#22240;&#20026;&#27599;&#19968;&#65288;&#27573;&#65289;&#34892;&#37117;&#24456;&#30701;&#12290;
&lt;/p&gt;
&lt;div class="org-src-container"&gt;

&lt;pre class="src src-org"&gt;&lt;span style="color: #ffd700; font-weight: bold;"&gt;* test&lt;/span&gt;
This is a test about soft
line-breaks for ox. &amp;#36825;&amp;#37324;&amp;#26377;&amp;#19968;&amp;#20010;&amp;#36719;
&amp;#25442;&amp;#34892;&amp;#12290;
&lt;/pre&gt;
&lt;/div&gt;

&lt;p&gt;
&#22240;&#27492;&#22312;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292; org-mode &#23558;&#36719;&#25442;&#34892;&#26367;&#25442;&#20026;&#19968;&#20010;&#31354;&#26684;&#12290;&#22240;&#27492;&#19979;&#38754;&#36825;&#20010;&#25991;&#26723;&#40664;&#35748;&#23548;&#20986; html &#26102;&#65292;&#20854;&#23454;&#21482;&#26377;&#19968;&#27573;&#12290;
&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;
This is a test about soft line-breaks for ox. &#36825;&#37324;&#26377;&#19968;&#20010;&#36719; &#25442;&#34892;&#12290;
&lt;/p&gt;
&lt;/blockquote&gt;

&lt;p&gt;
&#27880;&#24847;&#65292;&#8220;&#36719;&#8221;&#21644;&#8220;&#25442;&#8221;&#20043;&#38388;&#23384;&#22312;&#19968;&#20010;&#31354;&#26684;&#12290;org-mode &#23545;&#36719;&#25442;&#34892;&#30340;&#36825;&#31181;&#22788;&#29702;&#26159;&#26681;&#25454;&#35199;&#26041;&#30340;&#35821;&#35328;&#29305;&#28857;&#35774;&#35745;&#30340;&#65292;&#23545;&#20110;&#20013;&#25991;&#12289;&#26085;&#25991;&#31561;&#19996;&#26041;&#35821;&#35328;&#26469;&#35762;&#65292;&#36825;&#20250;&#20135;&#29983;&#19968;&#20010;&#19981;&#24517;&#35201;&#30340;&#31354;&#26684;&#12290;&#36825;&#20010;&#38382;&#39064;&#22312;&#26032;&#38395;&#32452;&#37324;&#24050;&#32463;&#34987;&#22810;&#20154;&#25351;&#20986;&#65292;&#22914;&lt;a href="http://comments.gmane.org/gmane.emacs.orgmode/64469"&gt;&#20316;&#20026;&#19968;&#20010; bug &#25552;&#20986;&lt;/a&gt;&#65292;&lt;a href="http://comments.gmane.org/gmane.emacs.orgmode/74385"&gt;&#26377;&#25130;&#22270;&#35828;&#26126;&lt;/a&gt;&#12290;
&lt;/p&gt;

&lt;p&gt;
&#36825;&#20854;&#23454;&#26159;&#19968;&#20010;&#22269;&#38469;&#21270;&#38382;&#39064;&#65292;&#24076;&#26395; org-mode &#33021;&#22815;&#23613;&#24555;&#23601;&#35813;&#38382;&#39064;&#32473;&#20986;&#19968;&#20010;&#23448;&#26041;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#30446;&#21069;&#23545;&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#23601;&#26159;&#65292;
&#35748;&#20026;&#20013;&#25991;&#23383;&#31526;&#19982;&#20013;&#25991;&#23383;&#31526;&#20043;&#38388;&#30340;&#25442;&#34892;&#37117;&#26159;&#27809;&#26377;&#24517;&#35201;&#30340;&#65292;&#22312; org-mode &#23436;&#25104; html &#23548;&#20986;&#26102;&#65292;&#23558;&#25152;&#26377;&#30340;&#36825;&#31181;&#25442;&#34892;&#21435;&#25481;&#12290;&#20195;&#30721;&#22914;&#19979;&#65292;
&#23601;&#19981;&#35299;&#37322;&#20102;&#65292;&#27809;&#26377;&#38590;&#24230;&#12290;&#37319;&#29992;&#24490;&#29615;&#30340;&#21407;&#22240;&#26159;&#22240;&#20026;&#31867;&#20284; replace-regexp-in-string &#36825;&#26679;&#30340;&#20989;&#25968;&#19981;&#33021;&#27491;&#30830;&#22788;&#29702;&#38548;&#19968;&#20010;&#20013;&#25991;&#23383;&#31526;&#23601;&#26377;&#36719;&#25442;&#34892;&#36825;&#31181;&#24773;&#20917;&#12290;
&lt;/p&gt;

&lt;div class="org-src-container"&gt;

&lt;pre class="src src-elisp"&gt;(&lt;span style="color: #ee3b3b;"&gt;defun&lt;/span&gt; &lt;span style="color: #ffffff; font-weight: bold;"&gt;clear-single-linebreak-in-cjk-string&lt;/span&gt; (string)
  &lt;span style="color: #ffa07a;"&gt;"clear single line-break between cjk characters that is usually soft line-breaks"&lt;/span&gt;
  (&lt;span style="color: #ee3b3b;"&gt;let*&lt;/span&gt; ((regexp &lt;span style="color: #7cfc00;"&gt;"&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;\\&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;(&lt;/span&gt;&lt;span style="color: #7cfc00;"&gt;[\u4E00-\u9FA5]&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;\\&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;)&lt;/span&gt;&lt;span style="color: #7cfc00;"&gt;\n&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;\\&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;(&lt;/span&gt;&lt;span style="color: #7cfc00;"&gt;[\u4E00-\u9FA5]&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;\\&lt;/span&gt;&lt;span style="color: #7cfc00; font-weight: bold;"&gt;)&lt;/span&gt;&lt;span style="color: #7cfc00;"&gt;"&lt;/span&gt;)
         (start (string-match regexp string)))
    (&lt;span style="color: #ee3b3b;"&gt;while&lt;/span&gt; start
      (setq string (replace-match &lt;span style="color: #7cfc00;"&gt;"\\1\\2"&lt;/span&gt; nil nil string)
            start (string-match regexp string start))))
  string)

(&lt;span style="color: #ee3b3b;"&gt;defun&lt;/span&gt; &lt;span style="color: #ffffff; font-weight: bold;"&gt;ox-html-clear-single-linebreak-for-cjk&lt;/span&gt; (string backend info)
  (&lt;span style="color: #ee3b3b;"&gt;when&lt;/span&gt; (org-export-derived-backend-p backend 'html)
    (clear-single-linebreak-in-cjk-string string)))

(add-to-list 'org-export-filter-final-output-functions
             'ox-html-clear-single-linebreak-for-cjk)
&lt;/pre&gt;
&lt;/div&gt;

&lt;p&gt;
&#20197;&#19978;&#20195;&#30721;&#21482;&#29992;&#20110; org-mode 8.0 &#20197;&#19978;&#29256;&#26412;&#65292;&#23545;&#20110;&#20302;&#29256;&#26412;&#26469;&#35828;&#65292;&#21487;&#20197;&#21442;&#32771;&lt;a href="http://permalink.gmane.org/gmane.emacs.orgmode/72147"&gt;&#27492;&#25991;&lt;/a&gt;&#33258;&#34892;&#32473;&#20986;&#12290;&#20851;&#20110;&#20013;&#25991;&#23383;&#31526;&#21644;&#33521;&#35821;&#23383;&#31526;&#20043;&#38388;&#30340;&#36719;&#25442;&#34892;&#65292;
&#21487;&#33021;&#36824;&#38656;&#35201;&#32771;&#34385;&#26356;&#22810;&#24773;&#20917;&#12290;&#20197;&#19978;&#20195;&#30721;&#20165;&#20165;&#36890;&#36807;&#21021;&#27493;&#27979;&#35797;&#65292;&#32780;&#19988;&#20063;&#21482;&#26159;&#24456;&#29255;&#38754;&#30340;&#32771;&#34385;&#20102;&#25105;&#24120;&#29992;&#30340;&#20960;&#31181;&#23548;&#20986;&#26684;&#24335;&#32780;&#24050;&#65292;&#21487;&#33021;&#36824;&#23384;&#22312;&#38382;&#39064;&#65292;&#27426;&#36814;&#25351;&#20986;&#12290;
&lt;/p&gt;
</content></entry><entry><title type="html">更新 org-mode 之后遗症</title><author><name>nil</name></author><link href="http://zjut.in:65011/posts/2013/05/28_66f465b0-org-mode-4e4b540e905775c7.html"/><updated>2013-05-28T20:39:00Z</updated><published>2013-05-28T20:39:00Z</published><id>posts/2013/05/28_66f465b0-org-mode-4e4b540e905775c7.html</id><category scheme="/tags/orgmode.html" term="orgmode" label="orgmode"/><content type="html">&lt;p&gt;
org-mode &#26356;&#26032;&#21040;8.0&#20102;&#65292;&#20869;&#37096;&#27169;&#22359;&#32463;&#36807;&#37325;&#20889;&#65292;&#21629;&#21517;&#20063;&#21464;&#21270;&#20102;&#19981;&#23569;&#65292;&#29305;&#21035;&#26159;export&#30456;&#20851;&#30340;&#12290;&#26356;&#26032;&#21518;&#65292;&#26368;&#30452;&#25509;&#30340;&#21518;&#36951;&#30151;&#23601;&#26159;&#25105;&#20197;&#21069;&#30340;&#37197;&#32622;&#25991;&#20214;&#24320;&#22987;&#19981;&#33021;&#27491;&#24120;&#24037;&#20316;&#20048;&#65292;&#38656;&#35201;&#20462;&#25913;&#12290;&#27492;&#22806;&#36824;&#21457;&#29616;&#25105;&#20043;&#21069;&#29992;&#26469;&#29983;&#25104;beamer&#30340;&#35838;&#20214;&#25991;&#20214;&#20063;&#24050;&#32463;&#19981;&#33021;&#27491;&#30830;&#20135;&#29983;&#20102;&#65292;&#38656;&#35201;&#20462;&#25913;&#25991;&#20214;&#20013;&#30340;&#19968;&#20123;&#23646;&#24615;&#35821;&#27861;&#12290;
&lt;/p&gt;

&lt;p&gt;
&#22240;&#27492;&#23601;&#33457;&#20102;&#19968;&#20123;&#26102;&#38388;&#65292;&#23558;org&#30340;&#37197;&#32622;&#37325;&#26032;&#25972;&#29702;&#20102;&#19968;&#30058;&#12290;&#21516;&#26102;&#23558;&#23548;&#33268;&#20195;&#30721;&#32553;&#36827;&#38169;&#35823;&#35299;&#20915;&#25481;&#65288;&#19981;&#35201;&#23558;
org-src-preserve-indentation&#35774;&#32622;&#20026;t&#65289;&#65292;&#23558;&#24433;&#21709;&#23548;&#20986;tex&#21518;&#30340;&#32534;&#35793;&#38169;&#35823;&#35299;&#20915;&#25481;&#65288;unicad&#23548;&#33268;&#32534;&#30721;&#30340;&#20462;&#25913;&#65289;&#12290;
&lt;/p&gt;

&lt;p&gt;
&#25509;&#19979;&#26469;&#65292;&#38656;&#35201;&#23545;&#35838;&#20214;&#36827;&#34892;&#25972;&#29702;&#65292;&#22240;&#20026;&#29616;&#22312;org-mode&#23558;&#19977;&#32423;&#65288;&#21450;&#20197;&#19978;&#65289;&#26631;&#39064;&#40664;&#35748;&#23548;&#20986;&#20026;block&#12290;&#22240;&#27492;&#20026;&#20102;&#23548;&#20986;item&#65292;&#38656;&#35201;&#23558;&#36825;&#20123;&#26631;&#39064;&#25913;&#25104;list&#12290;
&lt;/p&gt;
</content></entry><entry><title type="html">使用 o-blog 构建网站</title><author><name>nil</name></author><link href="http://zjut.in:65011/posts/2013/01/31_4f7f7528-o-blog-67845efa7f517ad9.html"/><updated>2013-01-31T23:52:00Z</updated><published>2013-01-31T23:52:00Z</published><id>posts/2013/01/31_4f7f7528-o-blog-67845efa7f517ad9.html</id><category scheme="/tags/emacs.html" term="emacs" label="emacs"/><content type="html">&lt;p&gt;
&#21457;&#29616; o-blog &#36824;&#26159;&#38750;&#24120;&#19981;&#38169;&#30340;&#65292;&#33267;&#23569;&#30028;&#38754;&#20063;&#27604;&#36739;&#32654;&#35266;&#12290;&#24320;&#22987;&#23581;&#35797;&#36890;&#36807;&#20462;&#25913; sample.org &#26469;&#26500;&#24314;&#33258;&#24049;&#30340;&#32593;&#31449;&#12290;
&#31895;&#30053;&#30340;&#30475;&#26469;&#65292;&#25972;&#20010;&#32467;&#26500;&#36824;&#26159;&#27604;&#36739;&#28165;&#26224;&#30340;&#65292;&#24456;&#23481;&#26131;&#25630;&#28165;&#26970;&#33258;&#24049;&#24212;&#35813;&#20462;&#25913;&#21738;&#20123;&#37096;&#20998;&#65292;&#20174;&#32780;&#33719;&#24471;&#33258;&#24049;&#24819;&#35201;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;


&lt;p&gt;
&#20294;&#26159;&#21482;&#33021;&#21333;&#25991;&#20214;&#65292;&#36825;&#35753;&#20154;&#27604;&#36739;&#37057;&#38391;&#65307;&#32780;&#19988;&#27599;&#27425;&#21457;&#24067;&#30340;&#26102;&#20505;&#65292;&#20284;&#20046;&#25152;&#26377;&#30340;&#25991;&#31456;&#37117;&#20250;&#26356;&#26032;&#65292;&#36825;&#19981;&#20165;&#28010;&#36153;&#26102;&#38388;&#65292;&#32780;&#19988;&#20063;&#23548;&#33268;&#19981;&#24517;&#35201;&#30340;&#25968;&#25454;&#21516;&#27493;&#12290;
&lt;/p&gt;
</content></entry>
</feed>
